{
    "questions": [
        "What is Data Science and how does it differ from traditional statistics?",
        "Can you briefly explain the data science lifecycle?",
        "What are some common libraries in Python used for data science and what are their uses?",
        "What is a pandas DataFrame in Python and how is it used in data science?",
        "Can you describe what 'data cleaning' is and why it's important in data science?",
        "What is machine learning in the context of data science, and how is it implemented in Python?",
        "What is the purpose of data visualization in data science and how can it be implemented in Python?",
        "Give an example of a problem you think data science could solve and how you would approach it using Python.",
        "Explain the concept of 'overfitting' in machine learning and how it can be avoided when working with Python.",
        "What are some ways to handle missing or corrupted data in a dataset when working in Python?",
        "What is SQL and why is it important in data science?",
        "Can you explain what a relational database is?",
        "What is the difference between SQL and NoSQL databases?",
        "Can you write a basic SQL query to retrieve specific data from a table?",
        "What are primary and foreign keys in SQL?",
        "How would you handle missing or null values in a SQL database?",
        "What are the different types of joins in SQL and when would you use each one?",
        "How would you use SQL for data cleaning?",
        "What is the difference between a clustered and a non-clustered index in SQL?",
        "How can SQL be used in data analysis and what are some of its limitations?",
        "What is Data Science?",
        "Can you explain the difference between supervised and unsupervised learning?",
        "What is linear regression in Data Science?",
        "What is logistic regression in Data Science?",
        "What is the role of data cleaning in data analysis?",
        "What is the concept of 'Overfitting' in Data Science?",
        "Can you name some common data visualization tools used in Data Science?",
        "What is a Decision Tree in Data Science?",
        "Can you explain the term 'Big Data'?",
        "What are some of the key mathematical skills required for Data Science?"
    ]
}